spec/fixtures/stripe_webhooks/customer.subscription.deleted.json

{"id": "evt_00000000000000", "object": "event", "api_version": "2017-05-25", "created": 1496232624, "data": {"object": {"id": "sub_00000000000000", "object": "subscription", "application_fee_percent": nil, "cancel_at_period_end": false, "canceled_at": nil, "created": 1496232623, "current_period_end": 1498824623, "current_period_start": 1496232623, "customer": "cus_Al1iHJsgh2iMj2", "discount": nil, "ended_at": nil, "items": {"object": "list", "data": [{"id": "si_00000000", "object": "subscription_item", "created": 1496232624, "plan": {"id": "s-basic", "object": "plan", "amount": 599, "created": 1494334156, "currency": "gbp", "interval": "month", "interval_count": 1, "livemode": false, "metadata": {}, "name": "S Basic", "statement_descriptor": nil, "trial_period_days": nil}, "quantity": 1}], "has_more": false, "total_count": 1, "url": ""}, "livemode": false, "metadata": {}, "plan": {"id": "s-basic", "object": "plan", "amount": 599, "created": 1494334156, "currency": "gbp", "interval": "month", "interval_count": 1, "livemode": false, "metadata": {}, "name": "S Basic", "statement_descriptor": nil, "trial_period_days": nil}, "quantity": 1, "start": 1496232623, "status": "active", "tax_percent": nil, "trial_end": nil, "trial_start": nil}}, "livemode": false, "pending_webhooks": 0, "request": "req_Al1inviVvNH7vG", "type": "customer.subscription.deleted"}